app/views/users/profile.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
    <div class="col-md-3" style="height: 45px"></div>
    <div class="col-md-2"><%= link_to "Publicaciones:#{@user.posts.count}","#" %></div>

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."post_id" = $1  ORDER BY "pictures"."id" ASC LIMIT 1  [["post_id", 10]]
---
          <h5><%= post.user.name %></h5>
          <%= image_tag post.pictures.first.image.url, class: 'img-post' %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
---
        <div class="col-md-4">
          <%= image_tag User.find_by(:id=>1).avatar.url, class: 'img-circle img-sugerencia' %>