app/controllers/users_controller.rb

  def sign_up
    # render(:text => params)
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def sign_in
    # render(:text => params)
    user = User.find_by_email(params[:sesion][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "b1.2@nomames.com"]]

  def profile
    # render(:text => params)
    @user = User.find_by_name(params[:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "sign_up"]]

  def upload_photo
    # render(:text => params)
    puts "aqui bota error"
    if current_user.update(user_params)
---
UPDATE "users" SET "avatar_file_name" = $1, "avatar_file_size" = $2, "avatar_updated_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["avatar_file_name", "maxresdefault.jpg"], ["avatar_file_size", 132050], ["avatar_updated_at", "2017-03-15 20:17:22.068189"], ["updated_at", "2017-03-15 20:17:22.078612"], ["id", 5]]

  def upload_cover
    if current_user.update(user_params)
---
UPDATE "users" SET "cover_file_name" = $1, "cover_file_size" = $2, "cover_updated_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["cover_file_name", "im1.jpg"], ["cover_file_size", 5384], ["cover_updated_at", "2017-03-15 20:22:22.844990"], ["updated_at", "2017-03-15 20:22:22.857468"], ["id", 5]]